Revit 2026 API

# TransformDeterminant Property

---

The determinant of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Determinant { get; }
```
```vb
Public ReadOnly Property Determinant As Double
	Get
```
```cpp
public:
property double Determinant {
	double get ();
}
```
```fsharp
member Determinant : float with get
```

#### Property Value

Double

The geometric meaning of a determinant is as the scale factor for volume when applied as linear transformation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace